## Relatório de Análise 4

## seleções de frequências

In [16]:
import pandas as pd

In [17]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep= ';')

In [18]:
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
22575,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
22576,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
22577,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
22578,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
22579,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

In [19]:
# Selecione somente os imóveis classificados com tipo 'Apartamento'.
selecao = dados['Tipo'] ==  'Apartamento'
selecao

n1 = dados[selecao].shape[0]
n1

19532

In [28]:
# Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
# operador OU alt+124 = |

selecao = (dados['Tipo'] == 'Casa') | (dados['Tipo'] == 'Casa de Condomínio') | (dados['Tipo'] == 'Casa de Vila') 
n2 = dados[selecao].shape[0]
n2

2212

In [31]:
# Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
# (60 <= Area <= 100) *************
# Operador e = &

selecao = (dados['Area'] >=60) & (dados['Area'] <= 100)
n3 = dados[selecao].shape[0]
n3

8719

In [ ]:
# Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.

In [34]:
selecao = (dados['Quartos'] >=4) & (dados['Valor'] < 2000)
n4 = dados[selecao].shape[0]
n4

41

In [37]:
print(f'''
Nª de imóveis classificados com tipo 'Apartamento' -> {n1}.

Nª de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila' -> {n2}.

Nª de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites -> {n3}.

Nª de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> {n4}.''')

Nª de imóveis classificados com tipo 'Apartamento' -> 19532.

Nª de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila' -> 2212.

Nª de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites -> 8719.

Nª de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> 41.

In [51]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [54]:
selecaoalunos = (alunos['Idade'] >= 10) & (alunos['Idade'] <= 20) | (alunos['Idade']) >= 40
s1 = alunos[selecaoalunos]
s1

Empty DataFrame
Columns: [Nome, Idade, Sexo, Notas, Aprovado]
Index: []